// Lab_03_3.cpp
// Саламаха Роман
// Лабораторна робота № 3.3
// Розгалуження, задане графіком функції.
// Варіант 25

#include <iostream>
#include <cmath>

using namespace std;

int main()
{
    double x; // аргумент
    double R; // вхідний параметр (радіус півкола, 0 < R <= 4)
    double y; // результат обчислення

    cout << "R = "; cin >> R;
    cout << "x = "; cin >> x;

    // розгалуження в повній формі
    if (x <= -2)
        y = x + 3;                                   // пряма через (-4;-1) і (-2;1)
    else
        if (x <= 0)
            y = (0 - x) / 2;                            // пряма через (-2;1) і (0;0)
        else
            if (x <= 4)
                y = -R * x / 4;                      // пряма через (0;0) і (4;-R)
            else
                if (x <= 8 - R)
                    y = -R;                          // горизонтальний відрізок
                else
                    if (x <= 8 + R)
                        y = -R + sqrt(R * R - (x - 8) * (x - 8)); // півколо з центром (8;-R)
                    else
                        y = -R;                      // горизонтальний промінь

    cout << endl;
    cout << "y = " << y << endl;

    cin.get();
    return 0;
}
